---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElevShape
source: html/5518f6a4-6d30-ec78-eefe-215d046e2c9a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElevShape Property

"Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId ElevShape { get; }
```